# REVISÓN TABLA sales.csv

## Importamos las librerías necesarias.

In [2]:
import pandas as pd
import numpy as np

## Obtener dataframe.

In [3]:
file = 'sales.csv'
path = '/Users/orlando/Documents/EasyMoney_back/tablas/'
df_sales = pd.read_csv(path+file)

In [4]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240773 entries, 0 to 240772
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Unnamed: 0  240773 non-null  int64
 1   pk_sale     240773 non-null  int64
 2   cid         240773 non-null  int64
 3   month_sale  240773 non-null  object
 4   product_ID  240773 non-null  int64
 5   net_margin  240773 non-null  float64
dtypes: float64(1), int64(4), object(1)
memory usage: 11.0+ MB

In [5]:
df_sales.head()

   Unnamed: 0  pk_sale    cid  month_sale  product_ID  net_margin
0           0     6666  33620  2018-05-01        2335       952.9
1           1     6667  35063  2018-06-01        2335      1625.2
2           2     6668  37299  2018-02-01        2335      1279.7
3           3     6669  39997  2018-02-01        2335      1511.9
4           4     6670  44012  2018-02-01        2335      1680.3

## Eliminamos la columna 'Unnamed: 0' por ser parecida al index.

In [6]:
df_sales.drop(columns=['Unnamed: 0'], inplace=True, errors='ignore')

## Comprobamos registros completos duplicados en el dataframe.

In [7]:
# No hay registros duplicados.
df_sales[df_sales.duplicated(keep=False)]

Empty DataFrame
Columns: [pk_sale, cid, month_sale, product_ID, net_margin]
Index: []

## Comprobamos registros nulos.

In [8]:
# No hay nulos.
df_sales.isna().sum()/len(df_sales) * 100

pk_sale       0.0
cid           0.0
month_sale    0.0
product_ID    0.0
net_margin    0.0
dtype: float64

## Cambiamos el tipo de los registros de la variable 'month_sale' a datetime.

In [9]:
df_sales['month_sale'] = pd.to_datetime(df_sales['month_sale'])

In [10]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240773 entries, 0 to 240772
Data columns (total 5 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   pk_sale     240773 non-null  int64
 1   cid         240773 non-null  int64
 2   month_sale  240773 non-null  datetime64[ns]
 3   product_ID  240773 non-null  int64
 4   net_margin  240773 non-null  float64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 9.2 MB

## Guardamos dataframe limpio.

In [11]:
df_sales_clean = df_sales.copy()

In [12]:
df_sales_clean

        pk_sale      cid month_sale  product_ID  net_margin
0          6666    33620 2018-05-01        2335       952.9
1          6667    35063 2018-06-01        2335      1625.2
2          6668    37299 2018-02-01        2335      1279.7
3          6669    39997 2018-02-01        2335      1511.9
4          6670    44012 2018-02-01        2335      1680.3
...         ...      ...        ...         ...         ...
240768   247434  1553456 2019-05-01        4657        56.7
240769   247435  1553541 2019-05-01        4657        66.5
240770   247436  1553559 2019-05-01        4657        73.0
240771   247437  1553565 2019-05-01        4657        82.3
240772   247438  1553571 2019-05-01        4657        84.4

[240773 rows x 5 columns]

## Exportamos a un nuevo archivo .csv

In [13]:
df_sales_clean.to_csv('/Users/orlando/Documents/EasyMoney_back/tablas/clean/sales_clean.csv', index=False)